/*
 * ¹Ú±¤·Ä
 * pkr7098@gmail.com
 * 2021-12-29
 * afio.h
 * afio °ü·Ã 
 
*/

#ifndef _AFIO_H
#define _AFIO_H

// =============================================================================

#include "typedef.h"

// =============================================================================

struct _AFIO {
  uint32_t        EVCR;
  uint32_t        MAPR;
  uint32_t        EXTICR1;
  uint32_t        EXTICR2;
  uint32_t        EXTICR3;
  uint32_t        EXTICR4;
  uint32_t        MAPR2;
};

// =============================================================================

extern volatile struct _AFIO *AFIO;

// =============================================================================

#endif
